IDEA Open Model
ArcSegment2D.Point Property
Compatible with IDEA StatiCa v 10.1
 Gets or sets the point of circular arc somewhere between start and end point.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public Point2D Point { get; set; }
Public Property Point As Point2D
	Get
	Set
public:
property Point2D^ Point {
	Point2D^ get ();
	void set (Point2D^ value);
}
Property Value
Type: Point2D
See Also
Reference
ArcSegment2D Class
IdeaRS.OpenModel.Geometry2D Namespace